In [65]:
import os   #current path
os.getcwd()

'C:\\Users\\MN\\Downloads'

In [66]:
import pandas as pd #import library

In [67]:
df = pd.read_csv('supershop.csv')#import Dataset

In [68]:
df.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [69]:
df.shape

(50, 5)

In [70]:
df.columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Area', 'Profit'], dtype='object')

In [71]:
x = df.drop('Profit', axis=1)#drop profit column
y = df['Profit']#assigne profit column in y variable

In [72]:
x.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [73]:
y.head()#default first 5 column show

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# 1. Normalization Scaling

In [74]:
from sklearn.preprocessing import MinMaxScaler#import MinMaxScaler

In [75]:
nor = MinMaxScaler()#object creat for MinMaxScaler

In [76]:
m_fit = nor.fit(df[['Marketing Spend']])    # fit marketing spend column,no change data

In [77]:
m_fit

MinMaxScaler()

In [78]:
df['Marketing Spend'] = nor.transform(df[['Marketing Spend']])  # Transform and  finally change data

In [79]:
df['Marketing Spend'].head() #show change data

0    0.692617
1    0.983359
2    0.927985
3    0.873136
4    0.859438
Name: Marketing Spend, dtype: float64

In [80]:
df.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

# fit & Transform at a same time

In [81]:
df['Administration'] = nor.fit_transform( df[['Administration']] )   # fit & Transform at a same time

In [82]:
df.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

# using, feature_range=(min, max)

In [83]:
nor = MinMaxScaler( feature_range=(2,5))#fixed feature_range

In [84]:
df.Transport = nor.fit_transform( df[['Transport']] )#fit_transform at the same time

In [85]:
df.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   5.000000    Dhaka  192261.83
1         0.983359        0.761972   4.822680      Ctg  191792.06
2         0.927985        0.379579   4.593991  Rangpur  191050.39
3         0.873136        0.512998   4.436705    Dhaka  182901.99
4         0.859438        0.305328   4.328407  Rangpur  166187.94

# 2. Standardization feature Transformation

In [86]:
df2 = pd.read_csv('supershop.csv')#import Dataset

In [87]:
df2.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [88]:
from sklearn.preprocessing import StandardScaler#import StandardScaler

In [89]:
stan = StandardScaler()#object creat for StandardScaler

In [90]:
df2['Marketing Spend'] = stan.fit_transform( df2[['Marketing Spend']] )#fit_transform at the same time
df2['Administration'] = stan.fit_transform( df2[['Administration']] )
df2['Transport'] = stan.fit_transform( df2[['Transport']] )

In [91]:
df2.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.560753   2.165287    Dhaka  192261.83
1         1.955860        1.082807   1.929843      Ctg  191792.06
2         1.754364       -0.728257   1.626191  Rangpur  191050.39
3         1.554784       -0.096365   1.417348    Dhaka  182901.99
4         1.504937       -1.079919   1.273550  Rangpur  166187.94

# 3. Max absolute Value Feature Transformation

In [92]:
df3 = pd.read_csv('supershop.csv')#import Dataset

In [93]:
df3.head()#default first 5 column show

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [94]:
from sklearn.preprocessing import MaxAbsScaler#import MaxAbsScaler

In [95]:
maxabs = MaxAbsScaler()#object creat for  MaxAbsScaler

In [96]:
df3['Marketing Spend'] = maxabs.fit_transform( df3[['Marketing Spend']] )#fit_transform at the same time
df3['Administration'] = maxabs.fit_transform( df3[['Administration']] )
df3['Transport'] = maxabs.fit_transform( df3[['Transport']] )

In [97]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94

# 4. Robust Scaler

In [98]:
df4 = pd.read_csv('supershop.csv')#import Dataset

In [99]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [100]:
from sklearn.preprocessing import RobustScaler#import RobustScaler

In [101]:
r = RobustScaler()#object creat for RobustScaler

In [102]:
df4['Marketing Spend'] = r.fit_transform( df4[['Marketing Spend']] )#fit_transform at the same time
df4['Administration'] = r.fit_transform( df4[['Administration']] )
df4['Transport'] = r.fit_transform( df4[['Transport']] )

In [103]:
df4.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.345355   1.552016    Dhaka  192261.83
1         1.452113        0.697565   1.383714      Ctg  191792.06
2         1.303634       -0.524290   1.166654  Rangpur  191050.39
3         1.156567       -0.097977   1.017368    Dhaka  182901.99
4         1.119836       -0.761543   0.914576  Rangpur  166187.94

# divided by max value of that column

In [104]:
df5 = pd.read_csv('supershop.csv')#import Dataset

In [105]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [106]:
df5['Marketing Spend'] = ( df5['Marketing Spend'] ) / max( df5['Marketing Spend'] )
df5['Administration'] = ( df5['Administration'] ) / max( df5['Administration'] )
df5['Transport'] = ( df5['Transport'] ) / max( df5['Transport'] )

In [107]:
df5.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.000000    Dhaka  192261.83
1         0.983359        0.828805   0.940893      Ctg  191792.06
2         0.927985        0.553781   0.864664  Rangpur  191050.39
3         0.873136        0.649738   0.812235    Dhaka  182901.99
4         0.859438        0.500378   0.776136  Rangpur  166187.94